"""
=========================================
Author:薄咊
Time:2020-10-18  14:34
comments:python学习
==========================================
"""
"""
if 条件:
    # 条件成立时执行的代码
"""
# 用户输入考试成绩，请判断是否及格？
score = float(input("请输入考试成绩："))

if score >= 60:
    print("考试成绩及格")

"""
if 条件:
    # 条件成立时执行的代码
else:
    #条件不成立时执行的代码
"""
# 用户输入考试成绩，请判断是否及格？
# score = float(input("请输入考试成绩："))
#
# if score >= 60:
#     print("考试成绩及格")
# else:
#     print("考试不及格，晚上通宵敲代码")
"""
if 条件1:
    # 条件1成立时执行的代码
elif 条件2:
    # 条件2成立时执行的代码
elif 条件3:
    # 条件3成立时执行的代码
else:
    # 以上条件均不成立时执行的代码
"""
# 根据用户输入考试成绩，请判断等级？
# score = float(input("请输入考试成绩："))
#
# if 0 <= score < 40:
#     print("考试成绩等级为：E")
# elif 40 <= score < 60:
#     print("考试成绩等级为：D")
# elif 60 <= score < 75:
#     print("考试成绩等级为：C")
# elif 75 <= score < 85:
#     print("考试成绩等级为：B")
# elif 85 <= score <= 100:
#     print("考试成绩等级为：A")
# else:
#     print("输入成绩有误！")
